# вводятся глобальные константы
# запускается программа и выводит на экран инструкцию для игроков.
# задается вопрос начинаем ли играть, просит ввести команду для старта
# задаются параметры поля, надо ввести ввести число из диапазона
# определяетcя кто первый ходит, принадлежность перового хода.
# Создаётcя новая игровая доска
# Отображает игровую доску на экране.
# Создаёт список доступных ходов.
# Определяет победителя в игре.
# Ход первого игрока
# Ход второго игрока
# Осуществляет переход хода, анализ ситуации на поле, поиск выйгрышных комбинаций
# Поздравление победителя игры
# Предложение повторить игру
# возврат к запуску программы, повторный запуск
